package Ex02;

public class TypeConversion {
/*
 * 타입 변환이란 데이터 타입을 다른 데이터 타입으로 변환하는 것을 말한다. 
 * 타입 변환에는 2가지 종류가 있다. 하나는 자동(묵시적) 타입 변환이고 다른 하나는
 * 강제(명시적) 타입 변환이다 
 * 
 * 자동 타입 변환(Promotion)은 프로그램 실행 도중에 자동적으로 타입 변환이 일어나는 것을 말한다.
 * 자동 타입 변환은 작은 크기를 가지는 타입이 큰 크기를 
 * 
 * 큰 크기 타입 = 작은 크기 타입 // 자동 타입 변환(Promotion)
 * 큰 크기 타입과 작은 크기 타입의 구분은 사용하는 메모리 크기이다. 예를 들어 byte 타입은 
 * 1byte 크기를 가지고, int 타입은 4byte 크기를 가지므로 int 타입이 큰 크기 타입이고, byte 타입이 작은 크기 타입이다. 
 * 
 *  byte(1) < short(2) < int(4) < long(8) < float<4) < doublle(8) 
 *  float은 4byte 크기인데 int(4byte)와 long(8byte)보다 큰 타입으로 표시했다. 
 *  그 이유는 표현할 수 있는 값의 범위가  float가 더 크기 때문이다. char타입은 음수 저장할 수 없다. 
 *  
 *  강제 타입 변환 
 *  
 *  강제적으로 큰 데이터 타입을 작은 데이터 타입으로 쪼개어서 저장하는 것을 강제 타입 변환 캐스팅:casting이라고 한다.
 *  강제 타입 변환은 캐스팅 연산자 ()를 사용하는데, 괄호 안에 들어가는 타입은 쪼개는 단위이다.
 *  작은 크기 타입 = (작은 크기 타입)큰 크기 타입 
 *  
 *  연산식에서의 자동 타입 변환 
 *  - 연산은 기본적으로 같은 타입의 피연산자(operand) 간에만 수행되기 때문에 서로 다른 타입의 피연산자가
 *  있을 경우 두 연산자중 크기가 큰 타입으로 자동 변환된 후 연산을 수행한다. 
 * */
}
