package chapter6;

public class InstanceAndThis {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 인스턴스 멤버와 this 
		// 인스턴스 멤버란 객체(인스턴스)를 생성한 후 사용할 수 있는 필드와 메소드를 말하는데, 이들을 각각 인스턴스 필드, 인스턴스 메소드라고 부른다
		// 인스턴스 필드와 메소드는 객체에 소속된 멤버이기 때문에 객체 없이는 사용할 수 없다. 
		
		// 정적 멤버와 static 
		// 정적(static)은  클래스에 고정된 멤버로서 객체를 생성하지 않고 사용할 수 있는 필드와 메소드를 말한다. 
		// 이들을 각자 정적 필드, 정적 메소드 정적 멤버는 객체(인스턴스)에 소속된 멤버가 아니고 클래스에 소속된 멤버이기 때문에
		// 클래스 멤버라고도 한다.
		// 정적 요소는 클래스 이름으로 접근하는것이 좋다.
	}

}
