package chapter6;

public class MethodContent {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//메소드란 객체의 동작에 해당하는 중괄호 블록을 말한다. 중괄호 블록은 이름을 가지고 있는데 이것이 메소드 이름이다. 
		//메소드를 호출하게 되면 중괄호 블록에 있는 모든 코드들이 일괄적으로 실행된다. 
		//메소드는 필드를 읽고 수정하는 역할도 하지만, 다른 객체를 생성해서 다양한 기능을 수행하기도 한다. 메소드는 객체간의 데이터 전달의 수단으로도 사용된다. 
		// 외부로부터 매개값을 받을 수도 있고 실행 후 ㅎ어떤 값을 리턴할 수도 있다. 
		// 메소드 선언은 선언부(리턴타입, 메소드 이름, 매개변수 선언) + 실행블록으로 구성된다. 
		//ex) 리턴타입 메소드이름 (매개변수선언) { 실행 코드 작성}  
		// 매개변수는 메소드가 실행할때 필요한 데이터를 외부로부터 받기 위해 사용된다. 매개변수도 필요한 경우가 있고 필요 없는 경우가 있다. 
		
		//ex) double divide(int x, int y) {int reslut = x+y}
		// double(10,20); // 메소드 호출
	}

}
